src/cf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовСПерсоналом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовСПодотчетниками</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовПоПерерасходу</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МагнитныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННВведенКорректно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/СотрудникиУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет заполнение реквизитов справочника "ВычетыНДФЛ" 
//
Процедура ЗаполнитьРазмерыВычетовНДФЛ() Экспорт
	
	РегистрыСведений.НДФЛРазмерВычетов.НачальноеЗаполнение();

КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРА ДВИЖЕНИЯ ПО РЕГИСТРАМ

// Выполняет движения по регистру накопления ПримененныеВычетыПоНДФЛ
// 
Процедура ОтразитьПримененныеВычетыПоНДФЛ(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПримененныеВычетыПоНДФЛ;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ПримененныеВычетыПоНДФЛ.Записывать = Истина;
	Движения.ПримененныеВычетыПоНДФЛ.Загрузить(Таблица);

КонецПроцедуры

// Выполняет движения по регистру накопления НДФЛДоходы
// 
Процедура ОтразитьНДФЛДоходы(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНДФЛДоходы;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.НДФЛДоходы.Записывать = Истина;
	Движения.НДФЛДоходы.Загрузить(Таблица);

КонецПроцедуры

// Выполняет движения по регистру накопления ТаблицаСтраховыеВзносыДоходы
// 
Процедура ОтразитьСтраховыеВзносыДоходы(ДокументСсылка, ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ПериодДокумента КАК Период,
	|	&Организация,
	|	ТаблицаНачисления.Сотрудник,
	|	ВидыНачисленийИУдержаний.ВидДоходаПоСтраховымВзносам КАК ВидДохода,
	|	СУММА(ВЫБОР
	|			КОГДА ВидыНачисленийИУдержаний.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|				ТОГДА ВЫРАЗИТЬ(ТаблицаНачисления.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) КАК СуммаНачисления,
	|	СУММА(ВЫБОР
	|			КОГДА ВидыНачисленийИУдержаний.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|				ТОГДА ВЫРАЗИТЬ(ТаблицаНачисления.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	0 КАК Скидка
	|ИЗ
	|	Документ.НачислениеЗарплатыУНФ.НачисленияУдержания КАК ТаблицаНачисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний
	|		ПО (ТаблицаНачисления.Ссылка = &Ссылка)
	|			И (ВидыНачисленийИУдержаний.Ссылка = ТаблицаНачисления.ВидНачисленияУдержания)
	|			И (ВидыНачисленийИУдержаний.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|				ИЛИ ВидыНачисленийИУдержаний.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ПериодДокумента, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ПериодДокумента, ) КАК КурсыВалютРасчетов
	|		ПО (&ВалютаДокумента = КурсыВалютРасчетов.Валюта)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНачисления.Сотрудник,
	|	ВидыНачисленийИУдержаний.ВидДоходаПоСтраховымВзносам";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ПериодДокумента", КонецМесяца(ДокументСсылка.ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ВалютаДокумента", ДокументСсылка.ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.СтраховыеВзносыДоходы.Загрузить(Таблица);
	
	Движения.СтраховыеВзносыДоходы.Записать();
	Движения.СтраховыеВзносыДоходы.Записывать = Ложь;
	
КонецПроцедуры

// Выполняет движения по регистру накопления РасчетыСФондамиПоСтраховымВзносамУНФ
// 
Процедура ОтразитьРасчетыСФондамиПоСтраховымВзносам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСФондамиПоСтраховымВзносам;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.РасчетыСФондамиПоСтраховымВзносамУНФ.Записывать = Истина;
	Движения.РасчетыСФондамиПоСтраховымВзносамУНФ.Загрузить(Таблица);

КонецПроцедуры

// Выполняет движения по регистру накопления НДФЛРасчетыНалоговыхАгентовСБюджетом
// 
Процедура ОтразитьНДФЛРасчетыНалоговыхАгентовСБюджетом(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНДФЛРасчетыНалоговыхАгентовСБюджетом;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.НДФЛРасчетыНалоговыхАгентовСБюджетом.Записывать = Истина;
	Движения.НДФЛРасчетыНалоговыхАгентовСБюджетом.Загрузить(Таблица);

КонецПроцедуры

// Функция рассчитывает среднесписочную численность работников
//
// Параметры:
//		Организация - СправочникСсылка.Организации
//		НачалоПериода - Дата
//		КонецПериода - Дата
//
// Возвращаемое значение:
//		Число
Функция СреднесписочнаяЧисленностьРаботающих(Организация, НачалоПериода, КонецПериода) Экспорт 
	
	ВсегоЧисленность = 0;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	НачМесяца = НачалоПериода;
	ДатыПоМесяцамТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК МесяцОтчета";
	ДатыПоМесяцамТекст = ДатыПоМесяцамТекст +"
	|ПОМЕСТИТЬ ВТМесяцыОтчета";
	Пока НачМесяца < НачалоМесяца(КонецПериода) Цикл
		НачМесяца = КонецМесяца(НачМесяца) + 1;
		ДатыПоМесяцамТекст = ДатыПоМесяцамТекст +"
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	ДатыПоМесяцамТекст = ДатыПоМесяцамТекст +"
	|ИНДЕКСИРОВАТЬ ПО МесяцОтчета";
	Запрос.Текст = ДатыПоМесяцамТекст;
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПериодыРаботыСотрудниковДатаПриема.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудникиОрганизации
	|ИЗ
	|	Документ.ПриемНаРаботуУНФ.Сотрудники КАК ПериодыРаботыСотрудниковДатаПриема
	|ГДЕ
	|	ПериодыРаботыСотрудниковДатаПриема.Ссылка.Организация = &Организация
	|	И ПериодыРаботыСотрудниковДатаПриема.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И ПериодыРаботыСотрудниковДатаПриема.Период <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ПериодыРаботыСотрудниковДатаПриема.Период <= &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СРЕДНЕЕ(ВЫРАЗИТЬ(СредняяЧисленностьПоМесяцам.СредняяЧисленность КАК ЧИСЛО(15, 0))) КАК СредняяЧисленность
	|ИЗ
	|	(ВЫБРАТЬ
	|		МесяцыОтчета.МесяцОтчета КАК МесяцОтчета,
	|		СУММА(ЕСТЬNULL(РАЗНОСТЬДАТ(ПериодыРаботыПоМесяцам.ДатаС, ЕСТЬNULL(ПериодыРаботыПоМесяцам.ДатаПо, НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(МесяцыОтчета.МесяцОтчета, МЕСЯЦ), ДЕНЬ)), ДЕНЬ) + 1, 0)) / РАЗНОСТЬДАТ(МесяцыОтчета.МесяцОтчета, ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(МесяцыОтчета.МесяцОтчета, МЕСЯЦ), СЕКУНДА, 1), ДЕНЬ) КАК СредняяЧисленность
	|	ИЗ
	|		ВТМесяцыОтчета КАК МесяцыОтчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МесяцыОтчета.МесяцОтчета КАК МесяцОтчета,
	|				ПериодыРаботы.Сотрудник КАК Сотрудник,
	|				ВЫБОР
	|					КОГДА ПериодыРаботы.ДатаНачала > МесяцыОтчета.МесяцОтчета
	|						ТОГДА ПериодыРаботы.ДатаНачала
	|					ИНАЧЕ МесяцыОтчета.МесяцОтчета
	|				КОНЕЦ КАК ДатаС,
	|				ВЫБОР
	|					КОГДА ПериодыРаботы.ДатаОкончания > КОНЕЦПЕРИОДА(МесяцыОтчета.МесяцОтчета, МЕСЯЦ)
	|						ТОГДА КОНЕЦПЕРИОДА(МесяцыОтчета.МесяцОтчета, МЕСЯЦ)
	|					ИНАЧЕ ПериодыРаботы.ДатаОкончания
	|				КОНЕЦ КАК ДатаПо
	|			ИЗ
	|				ВТМесяцыОтчета КАК МесяцыОтчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|						ДатаНачала.Сотрудник КАК Сотрудник,
	|						ДатаНачала.Организация КАК Организация,
	|						ДатаНачала.Период КАК ДатаНачала,
	|						МИНИМУМ(ЕСТЬNULL(ДатыОкончания.Период, &КонецПериода)) КАК ДатаОкончания
	|					ИЗ
	|						(ВЫБРАТЬ
	|							РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|							РаботникиОрганизаций.Организация КАК Организация,
	|							РаботникиОрганизаций.Период КАК Период
	|						ИЗ
	|							РегистрСведений.Сотрудники КАК РаботникиОрганизаций
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК ВТСотрудникиОрганизации
	|							ПО ВТСотрудникиОрганизации.Сотрудник = РаботникиОрганизаций.Сотрудник
	|						ГДЕ
	|							РаботникиОрганизаций.Должность <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|							И РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							РаботникиОрганизацийСрезПоследних.Сотрудник,
	|							РаботникиОрганизацийСрезПоследних.Организация,
	|							РаботникиОрганизацийСрезПоследних.Период
	|						ИЗ
	|							РегистрСведений.Сотрудники.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК ВТСотрудникиОрганизации
	|							ПО ВТСотрудникиОрганизации.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|						ГДЕ
	|							РаботникиОрганизацийСрезПоследних.Должность <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК ДатаНачала
	|							ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|								РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|								РаботникиОрганизаций.Организация КАК Организация,
	|								ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, ДЕНЬ, -1) КАК Период
	|							ИЗ
	|								РегистрСведений.Сотрудники КАК РаботникиОрганизаций
	|							ГДЕ
	|								 РаботникиОрганизаций.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|								И ВЫБОР
	|										КОГДА РаботникиОрганизаций.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|											ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, ДЕНЬ, -1)
	|										ИНАЧЕ РаботникиОрганизаций.Период
	|									КОНЕЦ <= ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|								И РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода) КАК ДатыОкончания
	|							ПО ДатаНачала.Сотрудник = ДатыОкончания.Сотрудник
	|								И ДатаНачала.Организация = ДатыОкончания.Организация
	|								И ДатаНачала.Период < ДатыОкончания.Период
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ДатаНачала.Сотрудник,
	|						ДатаНачала.Организация,
	|						ДатаНачала.Период) КАК ПериодыРаботы
	|					ПО (МесяцыОтчета.МесяцОтчета >= НАЧАЛОПЕРИОДА(ПериодыРаботы.ДатаНачала, МЕСЯЦ))
	|						И (МесяцыОтчета.МесяцОтчета <= КОНЕЦПЕРИОДА(ПериодыРаботы.ДатаОкончания, МЕСЯЦ))) КАК ПериодыРаботыПоМесяцам
	|			ПО МесяцыОтчета.МесяцОтчета = ПериодыРаботыПоМесяцам.МесяцОтчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МесяцыОтчета.МесяцОтчета) КАК СредняяЧисленностьПоМесяцам";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса <> Неопределено И Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.СредняяЧисленность) Тогда
				ВсегоЧисленность = Окр(Выборка.СредняяЧисленность);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВсегоЧисленность;
	
КонецФункции

// Возвращает соответствие видов налогов НДФЛ и их ставок.
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение:
//		*Ключ - СправочникСсылка.ВидыНалогов
//		*Значение - ПеречислениеСсылка.НДФЛСтавкиУНФ
//
Функция СтавкиНДФЛПоВидамНалогов() Экспорт
	
	СтавкиПоВидамНалогов = Новый Соответствие;
	СтавкиПоВидамНалогов.Вставить(Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины22,
		Перечисления.НДФЛСтавкиУНФ.Ставка22);
	СтавкиПоВидамНалогов.Вставить(Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины20,
		Перечисления.НДФЛСтавкиУНФ.Ставка20);
	СтавкиПоВидамНалогов.Вставить(Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины18,
		Перечисления.НДФЛСтавкиУНФ.Ставка18);
	СтавкиПоВидамНалогов.Вставить(Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины,
		Перечисления.НДФЛСтавкиУНФ.Ставка15);
	СтавкиПоВидамНалогов.Вставить(Справочники.ВидыНалогов.НДФЛСотрудники,
		Перечисления.НДФЛСтавкиУНФ.Ставка13);
	
	Возврат СтавкиПоВидамНалогов;
	
КонецФункции

// Распределяет указанную сумму между физическими лицами пропорционально суммам НДФЛ.
//
// Параметры:
//   Ссылка - ДокументСсылка - Ссылка на документ-регистратор
//   Организация - СправочникСсылка.Организации
//   ДатаОперации - Дата - Дата, на которую определяются остатки
//   Сумма - Число
//   МесяцНалоговогоПериода - Дата
//   СтавкаПревышения - ПеречислениеСсылка.НДФЛСтавкиУНФ
//   				  - Неопределено
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица с распределенными суммами по сотрудникам
Функция РаспределитьПеречисленныйНалогПоФизическимЛицам(Ссылка, Организация, ДатаОперации, Сумма,
	МесяцНалоговогоПериода, СтавкаПревышения = Неопределено) Экспорт

	ТипСумма = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));

	ПеречисленныеСуммы = Новый ТаблицаЗначений();
	ПеречисленныеСуммы.Колонки.Добавить("Сумма", ТипСумма);
	ПеречисленныеСуммы.Колонки.Добавить("СуммаСПревышения", ТипСумма);
	ПеречисленныеСуммы.Колонки.Добавить("СуммаСПревышенияПоСтавке18", ТипСумма);
	ПеречисленныеСуммы.Колонки.Добавить("СуммаСПревышенияПоСтавке20", ТипСумма);
	ПеречисленныеСуммы.Колонки.Добавить("СуммаСПревышенияПоСтавке22", ТипСумма);
	ПеречисленныеСуммы.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	Если СтавкаПревышения = Перечисления.НДФЛСтавкиУНФ.Ставка15 Тогда
		ИмяКолонки = "СуммаСПревышения";
		ИмяРесурса = "СуммаСПревышенияОстаток";
	ИначеЕсли СтавкаПревышения = Перечисления.НДФЛСтавкиУНФ.Ставка18 Тогда
		ИмяКолонки = "СуммаСПревышенияПоСтавке18";
		ИмяРесурса = "СуммаСПревышенияПоСтавке18Остаток";
	ИначеЕсли СтавкаПревышения = Перечисления.НДФЛСтавкиУНФ.Ставка20 Тогда
		ИмяКолонки = "СуммаСПревышенияПоСтавке20";
		ИмяРесурса = "СуммаСПревышенияПоСтавке20Остаток";
	ИначеЕсли СтавкаПревышения = Перечисления.НДФЛСтавкиУНФ.Ставка22 Тогда
		ИмяКолонки = "СуммаСПревышенияПоСтавке22";
		ИмяРесурса = "СуммаСПревышенияПоСтавке22Остаток";
	Иначе
		ИмяКолонки = "Сумма";
		ИмяРесурса = "СуммаОстаток";
	КонецЕсли;
	
	Если Сумма = 0 Тогда
		Возврат ПеречисленныеСуммы;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.Сотрудник КАК Сотрудник,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Остатки(
	|			&ДатаОперации,
	|			Организация = &Организация
	|				И ПериодРегистрации = &МесяцНалоговогоПериода) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Сотрудник КАК Сотрудник,
	|	СУММА(Остатки.Сумма) КАК Сумма
	|ИЗ
	|	ВТОстатки КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Сотрудник
	|
	|ИМЕЮЩИЕ
	|	СУММА(Остатки.Сумма) > 0";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СуммаОстаток", ИмяРесурса);

	Запрос = Новый Запрос(ТекстЗапроса);

	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОперации", ДатаОперации);
	Запрос.УстановитьПараметр("МесяцНалоговогоПериода", МесяцНалоговогоПериода);
	
	Результат = Запрос.Выполнить().Выгрузить();
	РезультатРаспределения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
		Сумма,
		ОбщегоНазначения.ВыгрузитьКолонку(Результат, "Сумма"));
	Если РезультатРаспределения = Неопределено Тогда
		Возврат ПеречисленныеСуммы;
	КонецЕсли;
	
	Индекс = 0;
	Для каждого СтрокаТЗ Из Результат Цикл
		НоваяСтрока = ПеречисленныеСуммы.Добавить();
		НоваяСтрока.Сотрудник = СтрокаТЗ.Сотрудник;
		НоваяСтрока[ИмяКолонки] = РезультатРаспределения[Индекс];
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат ПеречисленныеСуммы;
	
КонецФункции

// Распределяет указанную сумму перечисленного взноса пропорционально остаткам по сотрудникам.
//
// Параметры:
//   Ссылка - ДокументСсылка - Регистратор
//   Организация - СправочникСсылка.Организации
//   ДатаОперации - Дата
//   Сумма - Число - Сумма перечисленного взноса к распределению
//   ВидОбязательногоСтрахованияСотрудников - ПеречислениеСсылка.ВидыОбязательногоСтрахованияСотрудников - Вид страхования
//
// Возвращаемое значение:
//   ТаблицаЗначений
//		* Сотрудник - СправочникСсылка.Сотрудники
//		* Сумма - Число
Функция РаспределитьПеречисленныйВзносПоФизическимЛицам(Ссылка, Организация, ДатаОперации, Сумма,
	ВидОбязательногоСтрахованияСотрудников) Экспорт

	ПеречисленныеСуммы = Новый ТаблицаЗначений();
	ПеречисленныеСуммы.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ПеречисленныеСуммы.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	Если Сумма = 0 Тогда
		Возврат ПеречисленныеСуммы;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.Сотрудник КАК Сотрудник,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Остатки(
	|			&ДатаОперации,
	|			Организация = &Организация И ВидОбязательногоСтрахованияСотрудников = &ВидОбязательногоСтрахованияСотрудников И ЭтоСтраховыеВзносы) КАК РасчетыСФондамиПоСтраховымВзносамУНФ
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Сотрудник,
	|	СУММА(Остатки.Сумма) КАК Сумма
	|ИЗ
	|	ВТОстатки КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Сотрудник
	|
	|ИМЕЮЩИЕ
	|	СУММА(Остатки.Сумма) > 0;";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОперации", ДатаОперации);
	Запрос.УстановитьПараметр("ВидОбязательногоСтрахованияСотрудников", ВидОбязательногоСтрахованияСотрудников);
	
	Результат = Запрос.Выполнить().Выгрузить();
	РезультатРаспределения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
		Сумма,
		ОбщегоНазначения.ВыгрузитьКолонку(Результат,"Сумма"));
	Если РезультатРаспределения = Неопределено Тогда
		Возврат ПеречисленныеСуммы;
	Иначе
		Индекс = 0;
		Для каждого СтрокаТЗ Из Результат Цикл
			НоваяСтрока = ПеречисленныеСуммы.Добавить();
			НоваяСтрока.Сотрудник = СтрокаТЗ.Сотрудник;
			НоваяСтрока.Сумма = РезультатРаспределения[Индекс];
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПеречисленныеСуммы;
	
КонецФункции

// Находит сотрудника по указанному штрихкоду.
//
// Параметры:
//   ШтрихКод - Строка - Штрихкод для поиска сотрудника
//
// Возвращаемое значение:
//   СправочникСсылка.Сотрудники - Найденный сотрудник или Неопределено, если не найден
Функция СотрудникПоШтрихКоду(ШтрихКод) Экспорт
	
	ШтрихКод = СокрЛП(ШтрихКод);
	
	Если Не ЗначениеЗаполнено(ШтрихКод) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.ШтрихКод КАК ШтрихКод,
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ШтрихКод = &ШтрихКод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
